Autodesk.Revit.DB.Mullion.BreakMullion
This method is used to break the current Mullion at ends with its neighboring mullions.
Remarks:  The mullions being perpendicular to it will be joined accordingly.

Autodesk.Revit.DB.Mullion.JoinMullion
This method is used to control the join condition the current Mullion with its neighboring mullions.
Remarks:  The mullions being perpendicular to it will be broken accordingly.

Autodesk.Revit.DB.Mullion.LocationCurve
This method get the curve location of the current Mullion.

Autodesk.Revit.DB.Mullion.MullionType
The MullionType style of this Mullion.
Get - to access type of mullion
Set - change type of mullion. If the mullion is locked, InvalidOperationException exception will be thrown.

Autodesk.Revit.DB.Mullion.Lockable
Get - to get whether the Mullion can be lock or unlock.

Autodesk.Revit.DB.Mullion.Lock
Get - to get whether the Mullion line is locked.
Set - Lock/unlock the Mullion.

Autodesk.Revit.DB.Mullion
Represents a CurtainGrid within Autodesk Revit.